In [25]:
import pandas as pd
import numpy as np
 
data = {
    'Gender' : ['Male', 'Male', 'Female', 'Female', 'Male','Male','Male','Male','Female', 'Female'],
    'Fruit' : ['Apple',np.nan,'Banana','Apple',np.nan,'Strawberry','Banana','Banana','Apple', np.nan],
    'Age' : [20, 14, 13, 22, 14, 32, 31, 22,23, 33],
    'Height' : [187,np.nan,155,165,177,np.nan,170,179,np.nan, 166]
}
df = pd.DataFrame(data)
df

   Gender       Fruit  Age  Height
0    Male       Apple   20   187.0
1    Male         NaN   14     NaN
2  Female      Banana   13   155.0
3  Female       Apple   22   165.0
4    Male         NaN   14   177.0
5    Male  Strawberry   32     NaN
6    Male      Banana   31   170.0
7    Male      Banana   22   179.0
8  Female       Apple   23     NaN
9  Female         NaN   33   166.0

In [24]:
df

   Gender       Fruit  Age  Height
0    Male       Apple   20  187.00
1    Male         NaN   14  178.25
2  Female      Banana   13  155.00
3  Female       Apple   22  165.00
4    Male         NaN   14  177.00
5    Male  Strawberry   32  178.25
6    Male      Banana   31  170.00
7    Male      Banana   22  179.00
8  Female       Apple   23  162.00
9  Female         NaN   33  166.00

In [28]:
df

   Gender       Fruit  Age  Height
0    Male       Apple   20   187.0
1    Male         NaN   14     NaN
2  Female      Banana   13   155.0
3  Female       Apple   22   165.0
4    Male         NaN   14   177.0
5    Male  Strawberry   32     NaN
6    Male      Banana   31   170.0
7    Male      Banana   22   179.0
8  Female       Apple   23     NaN
9  Female         NaN   33   166.0

In [6]:
df.Fruit.value_counts()
df[df['Gender']=='Male']['Fruit']

0         Apple
1           NaN
4           NaN
5    Strawberry
6        Banana
7        Banana
Name: Fruit, dtype: object

In [7]:
df[df['Gender']=='Male']['Fruit'].mode()

0    Banana
Name: Fruit, dtype: object

In [12]:
df[df['Gender']=='Female']['Fruit'].mode()

0    Apple
Name: Fruit, dtype: object

In [11]:
df[df['Gender']=='Male']['Height'].mean()
df[df['Gender']=='Female']['Height'].mean() #162.0

162.0

In [ ]:
df.groupby('Gender')

In [17]:
df['Fruit'].fillna(df.groupby('Gender')['Fruit'].transform(lambda x:x.value_counts().idxmax()),inplace=True)

In [14]:
df['Fruit'].value_counts().idxmax()

'Apple'

In [29]:
df['Height'].fillna(df.groupby('Gender')['Height'].transform(lambda x: x.mean()),inplace=True)

In [30]:
# df['Height'].fillna(df.groupby('Gender')['Height'].mean(),inplace=True) 실행 안됨